configuration/src/Catalogs/AccessGroups/AccessGroups.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>AccessGroups</name>
  <hierarchical>true</hierarchical>
  <predefined>
    <items>
      <name>Administrators</name>
      <description>Administrators</description>
    </items>
  </predefined>
  <attributes>
    <name>Profile</name>
    <type>
      <types>CatalogRef.AccessGroupProfiles</types>
    </type>
  </attributes>
  <attributes>
    <name>User</name>
    <comment>Only for personal access groups</comment>
    <type>
      <types>CatalogRef.ExternalUsers</types>
      <types>CatalogRef.Users</types>
    </type>
  </attributes>
  <attributes>
    <name>Comment</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>EmployeeResponsible</name>
    <type>
      <types>CatalogRef.Users</types>
    </type>
  </attributes>
  <attributes>
    <name>MainSuppliedProfileAccessGroup</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Users</name>
    <attributes>
      <name>User</name>
      <type>
        <types>CatalogRef.ExternalUsers</types>
        <types>CatalogRef.ExternalUsersGroups</types>
        <types>CatalogRef.UserGroups</types>
        <types>CatalogRef.Users</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>AccessKinds</name>
    <attributes>
      <name>AccessKind</name>
      <comment>Represented by an empty reference of the main value type</comment>
      <type>
        <types>DefinedType.AccessValue</types>
      </type>
    </attributes>
    <attributes>
      <name>AllAllowed</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>AccessValues</name>
    <attributes>
      <name>AccessKind</name>
      <comment>Represented by an empty reference of the main value type</comment>
      <type>
        <types>DefinedType.AccessValue</types>
      </type>
    </attributes>
    <attributes>
      <name>AccessValue</name>
      <type>
        <types>DefinedType.AccessValue</types>
      </type>
    </attributes>
    <attributes>
      <name>IncludeSubordinateAccessValues</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

configuration/src/InformationRegisters/RolesRights/RolesRights.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>RolesRights</name>
  <resources>
    <name>RightUpdate</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>AddRight</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>UnrestrictedReadRight</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>UnrestrictedUpdateRight</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>UnrestrictedAddRight</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ViewRight</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>EditRight</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>InteractiveAddRight</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <dimensions>
    <name>MetadataObject</name>
    <type>
      <types>CatalogRef.MetadataObjectIDs</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Role</name>
    <type>
      <types>CatalogRef.MetadataObjectIDs</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

configuration/src/Catalogs/AccessGroupProfiles/AccessGroupProfiles.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>AccessGroupProfiles</name>
  <hierarchical>true</hierarchical>
  <predefined>
    <items>
      <name>Administrator</name>
      <description>Administrator</description>
    </items>
  </predefined>
  <attributes>
    <name>SuppliedDataID</name>
    <type>
      <types>UUID</types>
    </type>
  </attributes>
  <attributes>
    <name>SuppliedProfileChanged</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Comment</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Roles</name>
    <attributes>
      <name>Role</name>
      <type>
        <types>CatalogRef.ExtensionObjectIDs</types>
        <types>CatalogRef.MetadataObjectIDs</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>AccessKinds</name>
    <attributes>
      <name>AccessKind</name>
      <comment>Represented by an empty reference of the main value type</comment>
      <type>
        <types>DefinedType.AccessValue</types>
      </type>
    </attributes>
    <attributes>
      <name>Predefined</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>AllAllowed</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>AccessValues</name>
    <attributes>
      <name>AccessKind</name>
      <comment>Represented by an empty reference of the main value type</comment>
      <type>
        <types>DefinedType.AccessValue</types>
      </type>
    </attributes>
    <attributes>
      <name>AccessValue</name>
      <type>
        <types>DefinedType.AccessValue</types>
      </type>
    </attributes>
    <attributes>
      <name>IncludeSubordinateAccessValues</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Purpose</name>
    <attributes>
      <name>UsersType</name>
      <type>
        <types>DefinedType.User</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

configuration/src/Catalogs/Users/Users.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Users</name>
  <comment>APK:413 - # 744.2.1.1 it is Acceptable not to disable the selection history, since it is used, and the selection redefinition is fixed, that is, service and invalid users will not get into it, but if they somehow got into it, this is not a problem</comment>
  <attributes>
    <name>Invalid</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Department</name>
    <type>
      <types>DefinedType.Department</types>
    </type>
  </attributes>
  <attributes>
    <name>Individual</name>
    <type>
      <types>DefinedType.Individual</types>
    </type>
  </attributes>
  <attributes>
    <name>Comment</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>IsInternal</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Prepared</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>IBUserID</name>
    <type>
      <types>UUID</types>
    </type>
  </attributes>
  <attributes>
    <name>ServiceUserID</name>
    <type>
      <types>UUID</types>
    </type>
  </attributes>
  <attributes>
    <name>DeleteInfobaseUserProperties</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>Photo</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <tabularSections>
    <name>AdditionalAttributes</name>
    <attributes>
      <name>Property</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.AdditionalAttributesAndInfo</types>
      </type>
    </attributes>
    <attributes>
      <name>Value</name>
      <type>
        <types>Characteristic.AdditionalAttributesAndInfo</types>
      </type>
    </attributes>
    <attributes>
      <name>TextString</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ContactInformation</name>
    <attributes>
      <name>Type</name>
      <type>
        <types>EnumRef.ContactInformationTypes</types>
      </type>
    </attributes>
    <attributes>
      <name>Kind</name>
      <type>
        <types>CatalogRef.ContactInformationKinds</types>
      </type>
    </attributes>
    <attributes>
      <name>Presentation</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>FieldValues</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Country</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>State</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>City</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>EMAddress</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ServerDomainName</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>PhoneNumber</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>PhoneNumberWithoutCodes</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>KindForList</name>
      <type>
        <types>CatalogRef.ContactInformationKinds</types>
      </type>
    </attributes>
    <attributes>
      <name>Value</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

configuration/src/Catalogs/ExternalUsers/ExternalUsers.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ExternalUsers</name>
  <comment>APK:413 - # 744.2.1.1 it is Acceptable not to disable the selection history, since it is used, and the selection redefinition is fixed, that is, service and invalid users will not get into it, but if they somehow got into it, this is not a problem</comment>
  <attributes>
    <name>Invalid</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>AuthorizationObject</name>
    <type>
      <types>DefinedType.ExternalUser</types>
    </type>
  </attributes>
  <attributes>
    <name>SetRolesDirectly</name>
    <comment>Used if the &quot;access Control&quot; subsystem is not built in&quot;</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Comment</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Prepared</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>IBUserID</name>
    <type>
      <types>UUID</types>
    </type>
  </attributes>
  <attributes>
    <name>ServiceUserID</name>
    <type>
      <types>UUID</types>
    </type>
  </attributes>
  <attributes>
    <name>DeleteInfobaseUserProperties</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <tabularSections>
    <name>AdditionalAttributes</name>
    <attributes>
      <name>Property</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.AdditionalAttributesAndInfo</types>
      </type>
    </attributes>
    <attributes>
      <name>Value</name>
      <type>
        <types>Characteristic.AdditionalAttributesAndInfo</types>
      </type>
    </attributes>
    <attributes>
      <name>TextString</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

configuration/src/Catalogs/AccessGroups/ObjectModule.bsl
///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2023, OOO 1C-Soft
// All rights reserved. This software and the related materials 
// are licensed under a Creative Commons Attribution 4.0 International license (CC BY 4.0).
// To view the license terms, follow the link:
// https://creativecommons.org/licenses/by/4.0/legalcode
///////////////////////////////////////////////////////////////////////////////////////////////////////
//

#If Server Or ThickClientOrdinaryApplication Or ExternalConnection Then

#Region Variables

Var PreviousValues1; // 
                      // 

#EndRegion

#Region EventsHandlers

Procedure BeforeWrite(Cancel)
	
	If DataExchange.Load Then
		Return;
	EndIf;
	
	If IsFolder Then
		Return;
	EndIf;
	
	InformationRegisters.RolesRights.CheckRegisterData();
	
	PreviousValues1 = Common.ObjectAttributesValues(Ref,
		"Ref, Profile, DeletionMark, Users, AccessKinds, AccessValues");
	
	If Not Catalogs.ExtensionsVersions.AllExtensionsConnected() Then
		Catalogs.AccessGroupProfiles.RestoreNonexistentViewsFromAccessValue(PreviousValues1, ThisObject);
	EndIf;
	
	// Deleting blank members of the access group.
	IndexOf = Users.Count() - 1;
	While IndexOf >= 0 Do
		If Not ValueIsFilled(Users[IndexOf].User) Then
			Users.Delete(IndexOf);
		EndIf;
		IndexOf = IndexOf - 1;
	EndDo;
	
	If Ref = AccessManagement.AdministratorsAccessGroup() Then
		
		// Administrator predefined profile is always used.
		Profile = AccessManagement.ProfileAdministrator();
		
		// Cannot be a personal access group.
		User = Undefined;
		
		// Regular users cannot be responsible for the group (only full access users can).
		EmployeeResponsible = Undefined;
		
		// Only full access users can make changes.
		If Not PrivilegedMode()
		   And Not AccessManagement.HasRole("FullAccess") Then
			
			Raise
				NStr("en = 'The predefined access group ""Administrators""
				           |can be changed only if you have the ""Full access"" role
				           |or in privileged mode.';");
		EndIf;
		
		// Checking whether the access group contains regular users only.
		For Each CurrentRow In Users Do
			If TypeOf(CurrentRow.User) <> Type("CatalogRef.Users") Then
				Raise
					NStr("en = 'The predefined access group ""Administrators""
					           |can contain only users.
					           |
					           |User groups, external users, and
					           |external user groups are not allowed.';");
			EndIf;
		EndDo;
		
	// Administrator predefined profile cannot be set to an arbitrary access group.
	ElsIf Profile = AccessManagement.ProfileAdministrator() Then
		Raise
			NStr("en = 'Only the predefined access group ""Administrators""
			           |can have the predefined profile ""Administrator.""';");
	EndIf;
	
	If Not IsFolder Then
		
		// Automatically setting attributes for the personal access group.
		If ValueIsFilled(User) Then
			Parent = Catalogs.AccessGroups.PersonalAccessGroupsParent();
		Else
			User = Undefined;
			If Parent = Catalogs.AccessGroups.PersonalAccessGroupsParent(True) Then
				Parent = Undefined;
			EndIf;
		EndIf;
		
		// 
		// 
		If Not DeletionMark And PreviousValues1.DeletionMark = True Then
			BeginTransaction();
			Try
				Block = New DataLock;
				LockItem = Block.Add("Catalog.AccessGroupProfiles");
				LockItem.SetValue("Ref", Profile);
				Block.Lock();
				
				ProfileDeletionMark = Common.ObjectAttributeValue(Profile, "DeletionMark");
				ProfileDeletionMark = ?(ProfileDeletionMark = Undefined, False, ProfileDeletionMark);
				If ProfileDeletionMark Then
					LockDataForEdit(Profile);
					ProfileObject = Profile.GetObject();
					ProfileObject.DeletionMark = False;
					ProfileObject.Write();
				EndIf;
				
				CommitTransaction();
			Except
				RollbackTransaction();
				Raise;
			EndTry;	
		EndIf;
	EndIf;
	
EndProcedure

// Updates:
// - roles of added, remaining, and deleted users
// - InformationRegister.AccessGroupsTables
// - InformationRegister.AccessGroupsValues
//
Procedure OnWrite(Cancel)
	
	If DataExchange.Load Then
		Return;
	EndIf;
	
	If IsFolder Then
		Return;
	EndIf;
	
	If Not AdditionalProperties.Property("DoNotUpdateUsersRoles") Then
		UpdateUsersRolesOnChangeAccessGroup();
	EndIf;
	
	HasMembers = Users.Count() <> 0;
	HasOldMembers = PreviousValues1.Ref = Ref And Not PreviousValues1.Users.IsEmpty();
	
	If Profile           <> PreviousValues1.Profile
	 Or DeletionMark   <> PreviousValues1.DeletionMark
	 Or HasMembers <> HasOldMembers Then
		
		InformationRegisters.AccessGroupsTables.UpdateRegisterData(Ref);
	EndIf;
	
	If AccessManagementInternal.LimitAccessAtRecordLevelUniversally() Then
		CompositionOfRoleChanges = Catalogs.AccessGroups.RolesForUpdatingRights(PreviousValues1, ThisObject);
		AccessManagementInternal.ScheduleAnAccessUpdateWhenTheAccessGroupProfileChanges(
			"AccessGroupWhenChangingTheProfile", CompositionOfRoleChanges, Profile <> PreviousValues1.Profile);
	EndIf;
	
	If Catalogs.AccessGroups.AccessKindsOrAccessValuesChanged(PreviousValues1, ThisObject)
	 Or DeletionMark   <> PreviousValues1.DeletionMark
	 Or HasMembers <> HasOldMembers Then
		
		InformationRegisters.AccessGroupsValues.UpdateRegisterData(Ref);
	EndIf;
	
	Catalogs.AccessGroupProfiles.UpdateAuxiliaryProfilesDataChangedOnImport();
	Catalogs.AccessGroups.UpdateAccessGroupsAuxiliaryDataChangedOnImport();
	Catalogs.AccessGroups.UpdateAuxiliaryDataOfUserGroupsChangedOnImport();
	Catalogs.AccessGroups.UpdateUsersRolesChangedOnImport();
	
	If AccessManagementInternal.LimitAccessAtRecordLevelUniversally() Then
		ChangedMembersTypes = ChangedMembersTypes(Users, PreviousValues1.Users,
			DeletionMark <> PreviousValues1.DeletionMark);
		AccessManagementInternal.ScheduleAccessGroupsSetsUpdate(
			"AccessGroupsOnChangingMembers",
			ChangedMembersTypes.Users,
			ChangedMembersTypes.ExternalUsers);
		
		If Not DeletionMark Then
			AccessManagementInternal.ScheduleAccessUpdateOnChangeAccessGroupMembers(Ref,
				ChangedMembersTypes);
		EndIf;
		If DeletionMark <> PreviousValues1.DeletionMark Then
			AccessManagementInternal.UpdateAccessGroupsOfAllowedAccessKey(Ref);
		EndIf;
	EndIf;
	
EndProcedure

Procedure FillCheckProcessing(Cancel, CheckedAttributes)
	
	If AdditionalProperties.Property("VerifiedObjectAttributes") Then
		Common.DeleteNotCheckedAttributesFromArray(
			CheckedAttributes, AdditionalProperties.VerifiedObjectAttributes);
	EndIf;
	
EndProcedure

#EndRegion

#Region Private

// Parameters:
//  NewMembers - CatalogTabularSection.AccessGroups.Users
//  OldMembers - QueryResult
// Returns:
//  Structure:
//    * ExternalUsers - Boolean
//    * Users - Boolean
//
Function ChangedMembersTypes(NewMembers, OldMembers, DeletionTagHasChanged)
	
	ChangedMembersTypes = New Structure;
	ChangedMembersTypes.Insert("Users", False);
	ChangedMembersTypes.Insert("ExternalUsers", False);
	
	AllMembers = NewMembers.Unload(, "User");
	AllMembers.Columns.Add("LineChangeType", New TypeDescription("Number"));
	AllMembers.FillValues(1, "LineChangeType");
	If OldMembers <> Undefined Then
		Selection = OldMembers.Select();
		While Selection.Next() Do
			NewRow = AllMembers.Add();
			NewRow.User = Selection.User;
			NewRow.LineChangeType = -1;
		EndDo;
	EndIf;
	AllMembers.GroupBy("User", "LineChangeType");
	For Each String In AllMembers Do
		If String.LineChangeType = 0
		   And Not DeletionTagHasChanged Then
			Continue;
		EndIf;
		If TypeOf(String.User) = Type("CatalogRef.Users")
		 Or TypeOf(String.User) = Type("CatalogRef.UserGroups") Then
			ChangedMembersTypes.Users = True;
		EndIf;
		If TypeOf(String.User) = Type("CatalogRef.ExternalUsers")
		 Or TypeOf(String.User) = Type("CatalogRef.ExternalUsersGroups") Then
			ChangedMembersTypes.ExternalUsers = True;
		EndIf;
	EndDo;
	
	Return ChangedMembersTypes;
	
EndFunction

Procedure UpdateUsersRolesOnChangeAccessGroup()
	
	If Common.SubsystemExists("CloudTechnology.Core") Then
		ModuleSaaSOperations = Common.CommonModule("SaaSOperations");
		SessionWithoutSeparators = ModuleSaaSOperations.SessionWithoutSeparators();
	Else
		SessionWithoutSeparators = True;
	EndIf;
	
	If Common.DataSeparationEnabled()
		And Ref = AccessManagement.AdministratorsAccessGroup()
		And Not SessionWithoutSeparators
		And AdditionalProperties.Property("ServiceUserPassword") Then
		
		ServiceUserPassword = AdditionalProperties.ServiceUserPassword;
	Else
		ServiceUserPassword = Undefined;
	EndIf;
	
	SetPrivilegedMode(True);
	
	UsersForUpdate =
		Catalogs.AccessGroups.UsersForRolesUpdate(PreviousValues1, ThisObject);
	
	If Ref = AccessManagement.AdministratorsAccessGroup() Then
		// Adding users associated with infobase users with the FullAccess role.
		
		For Each IBUser In InfoBaseUsers.GetUsers() Do
			If IBUser.Roles.Contains(Metadata.Roles.FullAccess) Then
				
				FoundUser = Catalogs.Users.FindByAttribute(
					"IBUserID", IBUser.UUID);
				
				If Not ValueIsFilled(FoundUser) Then
					FoundUser = Catalogs.ExternalUsers.FindByAttribute(
						"IBUserID", IBUser.UUID);
				EndIf;
				
				If ValueIsFilled(FoundUser)
				   And UsersForUpdate.Find(FoundUser) = Undefined Then
					
					UsersForUpdate.Add(FoundUser);
				EndIf;
				
			EndIf;
		EndDo;
	EndIf;
	
	AccessManagement.UpdateUserRoles(UsersForUpdate, ServiceUserPassword);
	
EndProcedure

#EndRegion

#Else
Raise NStr("en = 'Invalid object call on the client.';");
#EndIf
